Documents/Лео_РасчетСебестоимостиПродукции/Лео_РасчетСебестоимостиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_РасчетСебестоимостиПродукции</name>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоСпец</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланЦенаМатериалы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланЦенаУпаковка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланЦенаКомплектуюшие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланЦенаМатЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродукцияКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ЦенаРЦЦ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_ЦенаПромоНаПолке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Лео_СтатусыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера7</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера8</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера9</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера11</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_НаценкаПартнера12</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФОТСуммаПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабМатЗатраты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабФОТ</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТехКарта</name>
      <type>
        <types>CatalogRef.ТехнологическиеКартыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаСмену</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовВсмене</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧеловекВсмене</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/Лео_ПлановыеСпецификацииНоменклатуры/Лео_ПлановыеСпецификацииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ПлановыеСпецификацииНоменклатуры</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СпецификацияНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/Лео_стоимостьПереработчиков/Лео_стоимостьПереработчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_стоимостьПереработчиков</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Лео_сменыПереработчиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДолжностьПереработчика</name>
    <type>
      <types>CatalogRef.Лео_ДолжностиПереработчиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаЦены</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦены</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипЦен</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/Лео_ПартияНоменклатуры/Лео_ПартияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ПартияНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОприходования</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.ВозвратМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.ОприходованиеМатериаловИзПроизводства</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/Лео_РасчетСебестоимостиПродукции/ObjectModule.bsl
Функция ПолучитьАктуальнуюСпецификацию() Экспорт
	
	ТЗспец = ПолучитьСпецификации();	
    ЭтотОбъект.Спецификация = Справочники.СпецификацииНоменклатуры.ПустаяСсылка();
	ЭтотОбъект.КоличествоПоСпец   = 0;

	Если ТЗспец.Количество() > 0 тогда
		
		мПоиПл  = ТЗспец.НайтиСтроки(Новый Структура("Номенклатура,Признак",ЭтотОбъект.Продукция,0));
		мПоиОсн = ТЗспец.НайтиСтроки(Новый Структура("Номенклатура,Признак",ЭтотОбъект.Продукция,1));
		
		Если мПоиПл.Количество() > 0 тогда
			ЭтотОбъект.Спецификация = мПоиПл[0].СпецификацияПлан;
			ЭтотОбъект.КоличествоПоСпец   = мПоиПл[0].КоличествоПлан;
		иначе
			ЭтотОбъект.Спецификация = мПоиОсн[0].СпецификацияОсн;
			ЭтотОбъект.КоличествоПоСпец   = мПоиОсн[0].Количество;
		КонецЕсли;	
		
	КонецЕсли;	
	Возврат ТЗспец;
КонецФункции           



Функция ПолучитьСпецификации()
	
	Текст = 
	
	"ВЫБРАТЬ
	|	ОсновныеСпецификацииНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ОсновныеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры КАК СпецификацияОсн,
	|	СпецификацииНоменклатурыВыходныеИзделия.Количество,
	|	NULL КАК СпецификацияПлан,
	|	0 КАК КоличествоПлан,
	|	1 КАК Признак
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	РегистрСведений.ОсновныеСпецификацииНоменклатуры.СрезПоследних(&_ДатаКон, ) КАК ОсновныеСпецификацииНоменклатурыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК СпецификацииНоменклатурыВыходныеИзделия
	|		ПО ОсновныеСпецификацииНоменклатурыСрезПоследних.Номенклатура = СпецификацииНоменклатурыВыходныеИзделия.Номенклатура
	|			И ОсновныеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры = СпецификацииНоменклатурыВыходныеИзделия.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Номенклатура,
	|	NULL,
	|	0,
	|	Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры,
	|	СпецификацииНоменклатурыВыходныеИзделия.Количество,
	|	0
	|ИЗ
	|	РегистрСведений.Лео_ПлановыеСпецификацииНоменклатуры.СрезПоследних(&_ДатаКон, ) КАК Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК СпецификацииНоменклатурыВыходныеИзделия
	|		ПО Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.Номенклатура = СпецификацииНоменклатурыВыходныеИзделия.Номенклатура
	|			И Лео_ПлановыеСпецификацииНоменклатурыСрезПоследних.СпецификацияНоменклатуры = СпецификацииНоменклатурыВыходныеИзделия.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.СпецификацияОсн,
	|	ТЗ.Количество,
	|	ТЗ.СпецификацияПлан,
	|	ТЗ.КоличествоПлан,
	|	ТЗ.Признак
	|ИЗ
	|	ТЗ КАК ТЗ
	|ГДЕ
	|	1 = 1"
	;		
	
	
	//Если ЗначениеЗаполнено(ВидНоменклатуры) тогда
	//	Текст = Текст + "
	//	|	 И ТЗ.Номенклатура.ВидНоменклатуры В (&ВидНоменклатуры)";
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(_Продукция) и _ПродукцияИспользование тогда
	Текст = Текст + "
	|	 И ТЗ.Номенклатура В (&_Продукция)";
	//КонецЕсли;
	
	
	Запрос = Новый Запрос;	
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияОбъектов.Утвержден);
	Запрос.УстановитьПараметр("_Продукция", ЭтотОбъект.Продукция);
	Запрос.УстановитьПараметр("_ДатаКон", КонецДня(ЭтотОбъект.Дата));
	
	Результат = Запрос.Выполнить();
	
	возврат Результат.Выгрузить();
	
	
КонецФункции


Функция МатЗатратыЗаполнить() Экспорт
	
	ТЗ_ИсходныеКомп_РЕЗ = неопределено;
	
	Основная = 0; //Плановая
	
	
	Спецификация = ЭтотОбъект.Спецификация;
	Номенклатура = ЭтотОбъект.Продукция;
	ДатаПланирования = КонецДня(ЭтотОбъект.Дата);
	Количество = ЭтотОбъект.КоличествоПоСпец;
	_ДатаКон = ДатаПланирования;
	
	////+ Количество уровней разузлования
	_СтруктураР = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(Спецификация,Количество,1,Основная,ДатаПланирования);
	ТЗ_ИсходныеКомплектующие = _СтруктураР.ИсходныеКомплектующие;
	
	Если ТЗ_ИсходныеКомп_РЕЗ = неопределено тогда
		ТЗ_ИсходныеКомп_РЕЗ = ТЗ_ИсходныеКомплектующие.Скопировать();
		ТЗ_ИсходныеКомп_РЕЗ.Очистить();
		ТЗ_ИсходныеКомп_РЕЗ.колонки.Добавить("Продукция");
		ТЗ_ИсходныеКомп_РЕЗ.колонки.Добавить("ПродукцияКоличество");
		
	КонецЕсли;
	////- Количество уровней разузлования
	
	
	УровеньРазузлования = абс_Дистрибуция.Лео_ПолучитьКоличествоУровнейРазузлования(Спецификация,Количество,Основная,ДатаПланирования);
	УровеньРазузлования = УровеньРазузлования + 5; //костыль надо поправить
	_СтруктураР = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(Спецификация,Количество,УровеньРазузлования,Основная,ДатаПланирования);
	
	Для каждого стр из _СтруктураР.ИсходныеКомплектующие цикл
		Если стр.Разузлован тогда
			
			сс = ТЗ_ИсходныеКомп_РЕЗ.Добавить();
			ЗаполнитьЗначенияСвойств(сс,стр);
			сс.Продукция = Номенклатура;
			сс.ПродукцияКоличество = Количество;
			сс.Спецификация = Спецификация;
		КонецЕсли;
	КонецЦикла;
	
	
	
	Если ТЗ_ИсходныеКомп_РЕЗ = неопределено тогда
		Сообщить("Не найдены спецификации для указанной продукции !");
		
	иначе	
		
		ТЗ_Прод = ТЗ_ИсходныеКомп_РЕЗ.Скопировать();
		ТЗ_Прод.Свернуть("Спецификация,Номенклатура,Продукция,ПродукцияКоличество","Количество");

		
		ТЗ_Прод.Колонки.Добавить("ПродукцияАртикул");
		ТЗ_Прод.Колонки.Добавить("НоменклатураАртикул");
		ТЗ_Прод.Колонки.Добавить("КоличествоЗаЕд");
		ТЗ_Прод.Колонки.Добавить("Цена");
		ТЗ_Прод.Колонки.Добавить("Ценапоследняя");
		
		ТЗ_Прод.Колонки.Добавить("ГруппаПродукция");
		ТЗ_Прод.Колонки.Добавить("ГруппаНоменклатура");
		ТЗ_Прод.Колонки.Добавить("СуммаПлан");
		
		
		
		Для каждого сс из ТЗ_Прод цикл 
			
			сс.ПродукцияАртикул    = сс.Продукция.Артикул;
			сс.НоменклатураАртикул = сс.Номенклатура.Артикул;
			
			сс.Цена = _ПолучитьЦенуПоПрайсуЛеоНастройки(КонецДня(_ДатаКон),сс.Номенклатура);
			
			сс.ЦенаПоследняя=получитьпоследнююцену(сс.Номенклатура,КонецДня(_ДатаКон));
			
			
			Если сс.ПродукцияКоличество > 0 тогда
				сс.КоличествоЗаЕд = сс.Количество/сс.ПродукцияКоличество;
			КонецЕсли;
			
			сс.ГруппаПродукция       = сс.Продукция.ВидНоменклатуры;
			сс.ГруппаНоменклатура    = сс.Номенклатура.ВидНоменклатуры;
			
			
			сс.СуммаПлан = сс.Цена * сс.КоличествоЗаЕд;
			
			ЭтотОбъект.ПродукцияКоличество = сс.ПродукцияКоличество;
		КонецЦикла;
		
	Конецесли;	
	
	
	возврат ТЗ_Прод;
КонецФункции	



Функция ТрудозатратыЗаполнить() Экспорт 
	
	ТЗ_ИсходныеКомп_РЕЗ = неопределено;

		Основная = 0;
		ДатаПланирования = КонецДня(ЭтотОбъект.Дата);
		Количество = ЭтотОбъект.КоличествоПоСпец;
		Спецификация = ЭтотОбъект.Спецификация;

		////+ Количество уровней разузлования
		_СтруктураР = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(Спецификация,Количество,1,Основная,ДатаПланирования);
		ТЗ_ИсходныеКомплектующие = _СтруктураР.ИсходныеКомплектующие;
		
		Если ТЗ_ИсходныеКомп_РЕЗ = неопределено тогда
			ТЗ_ИсходныеКомп_РЕЗ = ТЗ_ИсходныеКомплектующие.Скопировать();
			ТЗ_ИсходныеКомп_РЕЗ.Очистить();
			ТЗ_ИсходныеКомп_РЕЗ.колонки.Добавить("Продукция");
			ТЗ_ИсходныеКомп_РЕЗ.колонки.Добавить("ПродукцияКоличество");
			
		КонецЕсли;
		////- Количество уровней разузлования
		
		
		УровеньРазузлования = абс_Дистрибуция.Лео_ПолучитьКоличествоУровнейРазузлования(Спецификация,Количество,Основная,ДатаПланирования);
		
		ТекущийУроверь=1;
		_СтруктураР = абс_Дистрибуция.Лео_РазузловатьНоменклатуру(Спецификация,Количество,УровеньРазузлования,Основная,ДатаПланирования);
		
		
		ТекущийУроверь=ТекущийУроверь+1;	
		Для каждого стр из _СтруктураР.ВыходныеИзделия цикл
			
			сс = ТЗ_ИсходныеКомп_РЕЗ.Добавить();
			ЗаполнитьЗначенияСвойств(сс,стр);
			сс.Продукция = стр.Номенклатура;
			сс.ПродукцияКоличество = стр.Количество;
			сс.Спецификация = стр.Спецификация;
			
		конецЦикла;
		
	
	Если ТЗ_ИсходныеКомп_РЕЗ = неопределено тогда
		Сообщить("Не найдены спецификации для указанной продукции !");
		
	иначе	
		
		ТЗ_Прод = ТЗ_ИсходныеКомп_РЕЗ.Скопировать();
		ТЗ_Прод.Свернуть("Спецификация,Номенклатура,Продукция","ПродукцияКоличество,Количество");
		ТЗ_Прод.Колонки.Добавить("ПродукцияАртикул");
		ТЗ_Прод.Колонки.Добавить("НоменклатураАртикул");
		ТЗ_Прод.Колонки.Добавить("КоличествоЗаЕд");
		ТЗ_Прод.Колонки.Добавить("Цена");
		ТЗ_Прод.Колонки.Добавить("Ценапоследняя");
		
		ТЗ_Прод.Колонки.Добавить("ГруппаПродукция");
		ТЗ_Прод.Колонки.Добавить("ГруппаНоменклатура");
		ТЗ_Прод.Колонки.Добавить("ТехКарта",Новый ОписаниеТипов("СправочникСсылка.ТехнологическиеКартыПроизводства"));
		ТЗ_Прод.Колонки.Добавить("Должность");
		ТЗ_Прод.Колонки.Добавить("КоличествоЗаСмену");
		ТЗ_Прод.Колонки.Добавить("КоличествоТребуетсяпоНорме");
		ТЗ_Прод.Колонки.Добавить("ЧасовВсмене");
		ТЗ_Прод.Колонки.Добавить("ЧеловекВсмене");
		
		Для каждого сс из ТЗ_Прод цикл 
			сс.ПродукцияАртикул    = сс.Продукция.Артикул;
			сс.НоменклатураАртикул = сс.Номенклатура.Артикул;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТехнологическиеКартыСпецификацийПланированияСрезПоследних.ТехнологическаяКарта
			|ИЗ
			|	РегистрСведений.ТехнологическиеКартыСпецификацийПланирования.СрезПоследних КАК ТехнологическиеКартыСпецификацийПланированияСрезПоследних
			|ГДЕ
			|	ТехнологическиеКартыСпецификацийПланированияСрезПоследних.Спецификация = &Спецификация";
			
			Запрос.УстановитьПараметр("Спецификация", сс.Спецификация);
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				сс.ТехКарта=ВыборкаДетальныеЗаписи.ТехнологическаяКарта;
			КонецЦикла;
			
		КонецЦикла;
		
		ТЗ_Прод_ТЕХ = ТЗ_Прод.Скопировать();
		ТЗ_Прод_ТЕХ.Очистить();
		
		Для каждого сс из ТЗ_Прод цикл 
			
			Для каждого ссс из сс.ТехКарта.Маршрут цикл		
				
				сссс = ТЗ_Прод_ТЕХ.Добавить();
				ЗаполнитьЗначенияСвойств(сссс,сс);
				
				сссс.ТехКарта = сс.ТехКарта;
				сссс.Должность=ссс.Должность;
				сссс.ЧеловекВсмене=ссс.Количество;
				
				сссс.КоличествоЗаСмену = сс.ТехКарта.ОбъемПартии;
				сссс.Количество = сссс.ПродукцияКоличество*ссс.Количество/сссс.КоличествоЗаСмену;
				сссс.ЧасовВсмене = 8;           
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Лео_стоимостьПереработчиковСрезПоследних.ЦенаБезНДС КАК Цена,
				|	Лео_стоимостьПереработчиковСрезПоследних.Контрагент,
				|	Лео_стоимостьПереработчиковСрезПоследних.Должность,
				|	Лео_стоимостьПереработчиковСрезПоследних.Смена
				|ИЗ
				|	РегистрСведений.Лео_стоимостьПереработчиков.СрезПоследних(&Дата, ) КАК Лео_стоимостьПереработчиковСрезПоследних
				|ГДЕ
				|	Лео_стоимостьПереработчиковСрезПоследних.ДолжностьПереработчика = &Должность
				|	И Лео_стоимостьПереработчиковСрезПоследних.Контрагент = &Контрагент
				|	И Лео_стоимостьПереработчиковСрезПоследних.Смена = &Смена";
				
				//{Катанович   // стоимость переработчиков меняется
				Запрос.УстановитьПараметр("Дата", ДатаПланирования);
                //Катанович}
				Запрос.УстановитьПараметр("Должность", сссс.Должность);
				Запрос.УстановитьПараметр("Смена", сс.ТехКарта.Смена);
				Запрос.УстановитьПараметр("Контрагент", ссс.Контрагент);
				
				Результат = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = Результат.Выбрать();
				
				_Маршрут = сс.ТехКарта.Маршрут.Выгрузить();
				_Маршрут.Свернуть("Контрагент,Должность");
				_Маршрут.Сортировать("Контрагент Убыв");
				
				
				ЕстьКонтрагент = Ложь;
				Если _Маршрут.Количество() > 0 тогда
					ЕстьКонтрагент = Истина;
				КонецЕсли;	
					
				сссс.Цена = 0;	
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ЕстьКонтрагент тогда 
						мПоиска = _Маршрут.НайтиСтроки(Новый Структура("Контрагент,Должность",ВыборкаДетальныеЗаписи.Контрагент,ВыборкаДетальныеЗаписи.Должность));
						
						Если  мПоиска.Количество() > 0 тогда
							сссс.Цена=ВыборкаДетальныеЗаписи.Цена;
						КонецЕсли;  
					иначе
						сссс.Цена=ВыборкаДетальныеЗаписи.Цена;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если сссс.ПродукцияКоличество > 0 тогда
					сссс.КоличествоЗаЕд = сссс.Количество/сссс.ПродукцияКоличество;
				КонецЕсли;
				
				сссс.ГруппаПродукция = ЭтотОбъект.Продукция.ВидНоменклатуры;

			КонецЦикла;
		КонецЦикла;
		КонецЕсли;
		
		возврат ТЗ_Прод_ТЕХ
		
	КонецФункции  
	
	
Функция _ПолучитьЦенуПоПрайсуЛеоНастройки(ДатаКон,_Номенклатура) Экспорт
	
	_Цена = 0;
	
	_ТипЦен = ЭтотОбъект.ТипЦен;
	Если НЕ _ТипЦен.Пустая() тогда
		  сПараметров = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаКон,Новый Структура("ТипЦен,Номенклатура",_ТипЦен,_Номенклатура));
		
		  _Цена = сПараметров.Цена;
		
	КонецЕсли;	  
	
	Возврат _Цена;
	
КонецФункции


Функция ПолучитьПоследнююЦену(ссноменклатура,_ДатаКон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Лео_ПартияНоменклатурыСрезПоследних.ДокументОприходования) КАК ДокументОприходования,
	|	Лео_ПартияНоменклатурыСрезПоследних.Цена,
	|	Лео_ПартияНоменклатурыСрезПоследних.ЦенаСНДС,
	|	Лео_ПартияНоменклатурыСрезПоследних.Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	(ВЫБРАТЬ
	|		Лео_ПартияНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(Лео_ПартияНоменклатурыСрезПоследних.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.Лео_ПартияНоменклатуры.СрезПоследних(&дата, ) КАК Лео_ПартияНоменклатурыСрезПоследних
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Лео_ПартияНоменклатурыСрезПоследних.Номенклатура) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лео_ПартияНоменклатуры.СрезПоследних КАК Лео_ПартияНоменклатурыСрезПоследних
	|		ПО ВложенныйЗапрос.Номенклатура = Лео_ПартияНоменклатурыСрезПоследних.Номенклатура
	|			И ВложенныйЗапрос.Период = Лео_ПартияНоменклатурыСрезПоследних.Период
	|ГДЕ
	|	ВложенныйЗапрос.Номенклатура = &ссноменклатура
	|	И Лео_ПартияНоменклатурыСрезПоследних.Номенклатура = &ссноменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	Лео_ПартияНоменклатурыСрезПоследних.Цена,
	|	Лео_ПартияНоменклатурыСрезПоследних.ЦенаСНДС,
	|	Лео_ПартияНоменклатурыСрезПоследних.Номенклатура.Артикул
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ДокументОприходования";
	
	Запрос.УстановитьПараметр("дата", _ДатаКон);
	Запрос.УстановитьПараметр("ссноменклатура", ссноменклатура);
	
	Результат = Запрос.Выполнить();
	результаткк=0;
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		результаткк	= ВыборкаДетальныеЗаписи.Цена;
		
	КонецЦикла;
	
	Возврат результаткк;
	
	
КонецФункции


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	
	ФОТСуммаПлан = ТабФОТ.Итог("СуммаПлан");
	
КонецПроцедуры
